quadcopter/quadcopter.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-12-27 Sun 18:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Quadcopter Documentation</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="William Murrah" />
</head>
<body>
<div id="content">
<h1 class="title">Quadcopter Documentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline4">1. Resources</a>
<ul>
<li><a href="#orgheadline1">1.1. Hardware</a></li>
<li><a href="#orgheadline2">1.2. Software</a></li>
<li><a href="#orgheadline3">1.3. Tutorials/How-to/blogs</a></li>
</ul>
</li>
<li><a href="#orgheadline10">2. Potential Quadcopter Components</a>
<ul>
<li><a href="#orgheadline5">2.1. Platform</a></li>
<li><a href="#orgheadline7">2.2. Control</a>
<ul>
<li><a href="#orgheadline6">2.2.1. Raspberry pi 2 model B</a></li>
</ul>
</li>
<li><a href="#orgheadline8">2.3. Sensor</a></li>
<li><a href="#orgheadline9">2.4. Effector</a></li>
</ul>
</li>
<li><a href="#orgheadline15">3. Fleet Plan</a>
<ul>
<li><a href="#orgheadline11">3.1. Phase I: RTF</a></li>
<li><a href="#orgheadline12">3.2. Phase II: Programmable</a></li>
<li><a href="#orgheadline13">3.3. Phase III:</a></li>
<li><a href="#orgheadline14">3.4. Bitcraze Crazyflie nano quadcopter</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">1</span> Resources</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Hardware</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://www.raspberrypi.org/">raspberry pi</a>
<a href="https://www.electricwingman.com/">electricwingman</a>
<a href="http://www.unmannedtech.co.uk/">unmannedtech</a> 
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Software</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="http://ardupilot.com/">ardupilot</a>
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> Tutorials/How-to/blogs</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<a href="http://blog.pistuffing.co.uk/">pistuffing</a> raspberry pi project blog
<a href="http://www.droneflyers.com/">drone flyers</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">2</span> Potential Quadcopter Components</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.1</span> Platform</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://store.3drobotics.com/products/iris">3d Robotics Iris+ Multicopter 915 Mhz 3DR</a> (<a href="http://www.amazon.com/Robotics-Multicopter-Brushless-Gimbal-Battery/dp/B0124VK94E/ref=sr_1_7?ie=UTF8&amp;qid=1451248774&amp;sr=8-7&amp;keywords=iris+quadcopter+batteries">amazon.com</a>)
</p>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">2.2</span> Control</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">2.2.1</span> Raspberry pi 2 model B</h4>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">2.3</span> Sensor</h3>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.4</span> Effector</h3>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15"><span class="section-number-2">3</span> Fleet Plan</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">3.1</span> Phase I: RTF</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">drone</th>
<th scope="col" class="org-right">cost</th>
<th scope="col" class="org-left">flt. time</th>
<th scope="col" class="org-left">chrg. time</th>
<th scope="col" class="org-left">cntrl. dist.</th>
<th scope="col" class="org-left">freq</th>
<th scope="col" class="org-left">wt.</th>
<th scope="col" class="org-left">size</th>
<th scope="col" class="org-left">battery</th>
<th scope="col" class="org-left">memory</th>
<th scope="col" class="org-left">blade prot.</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Syma X5C</td>
<td class="org-right">49.88</td>
<td class="org-left">7 min</td>
<td class="org-left">100 min</td>
<td class="org-left">30 meters</td>
<td class="org-left">2.4 Ghz</td>
<td class="org-left">107g</td>
<td class="org-left">31x31x8cm</td>
<td class="org-left">3.7V Li-poly</td>
<td class="org-left">2GB MicroSD</td>
<td class="org-left">yes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">3.2</span> Phase II: Programmable</h3>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">3.3</span> Phase III:</h3>
</div>

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">3.4</span> Bitcraze Crazyflie nano quadcopter</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<a href="http://www.i-programmer.info/news/169-robotics/5653-nano-quadcopter-your-personal-flying-robot.html">iprogrammer</a>
This unit his on back order and requires soldering
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: William Murrah</p>
<p class="date">Created: 2015-12-27 Sun 18:54</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
